<template>
  <div>
    <div class="banner">
      <img :src="banner" alt="" />
    </div>
    <div class="title">
      <div class="titleText">
        <div class="wow slideInRight">
          <div>最新动态</div>
        </div>
      </div>
    </div>
    <el-row class="allthree">
      <el-col :md="8" v-for="(card, index) in cards" :key="index">
        <div class="threeBox" @click="goDetail(card)">
          <div class="threeBtm wow rotateInDownLeft"></div>
          <div class="threeTop wow rotateInUpRight">
            <img :src="threeTwo" alt="" />
            <div>
              <p>{{card.title}}</p>
              <p class="time">{{card.time}}</p>
            </div>
          </div>
        </div>
      </el-col>
    </el-row>
  </div>
</template>

<script>
import banner_url from "@/assets/homePage/banner.png";
import down_url from "@/assets/buildStation/down.png";
import computer_url from "@/assets/buildStation/computer.png";
import threeOne_url from "@/assets/buildStation/threeOne.png";
import threeTwo_url from "@/assets/buildStation/threeTwo.png";
import threeThree_url from "@/assets/buildStation/threeThree.png";
import { WOW } from "wowjs";
export default {
  name: "build-station",
  data() {
    return {
      banner: banner_url,
      down: down_url,
      computer: computer_url,
      threeOne: threeOne_url,
      threeTwo: threeTwo_url,
      threeThree: threeThree_url,
      cards: [
        {
          title: '发展趋势',
          time: '2013-08-19',
          key: 1,
          content: '当今世界各国压力变送器的研究领域十分广泛，几乎渗透到了各个行业，但归纳起来主要有以下几个趋势：<br>1、智能化：由于集成化的出现,在集成电路中可添加一些微处理器,使得变送器具有自动补偿、通讯、自诊断、逻辑判断等功能。<br>2、集成化：压力变送器已经越来越多的与其它测量用变送器集成以形成测量和控制系统。集成系统在过程控制和工厂自动化中可提高操作速度和效率。<br>3、小型化：市场对小型压力变送器的需求越来越大，这种小型变送器可以工作在极端恶劣的环境下，并且只需要很少的保养和维护，对周围的环境影响也很小，可以放置在人体的各个重要器官中收集资料，不影响人的正常生活。<br>4、标准化：变送器的设计与制造已经形成了一定的行业标准。<br>5、广泛化：压力变送器的另一个发展趋势是正从机械行业向其它领域扩展，例如:汽车元件、医疗仪器和能源环境控制系统。'
        },
        {
          title: '发展历史',
          time: '2013-08-19',
          key: 2,
          content: '压力变送器是许多工业设备中用以控制工业过程和压力变化的重要原件。压力变送器用于测量液体、气体或蒸汽的液位、密度和压力，然后将压力信号转变成4～20mADC信号输出。压力变送器分电容式压力变送器和扩散硅压力变送器，陶瓷压力变送器，应变式压力变送器等。</br>压力变送器是直接与被测介质相接触的现场仪表，常常在高温低温腐蚀振动冲击等环境中工作。在石油、化工、电力、钢铁、轻工等行业的压力测量及现场控制中应用非常广泛。</br>压力变送器的发展大体经历了四个阶段：</br>1、早期压力变送器采用大位移式工作原理，如曾大量生产的水银浮子式差压计及膜盒式差压变送器，这些变送器精度低且笨重。</br>2、20世纪50年代有了精度稍高的力平衡式差压变送器，但反馈力小，结构复杂，可靠性、稳定性和抗振性均较差。</br>3、70年代中期，随着新工艺、新材料、新技术的出现，尤其是电子技术的迅猛发展出现体积小巧、结构简单的位移式变送器。</br>4、90年代科学技术迅猛发展，这些变送器测量精度高而且逐渐向智能化发展数字信号传输更有利于数据采集。</br>压力变送器发展至今已有电容式变送器、扩散硅压阻式变送器、差动电感式变送器和陶瓷电容式变送器等不同类型。</br>20世纪90年代，现场总线技术迅速崛起，工业过程控制系统逐渐向具有双向通信和智能仪表控制的现场总线控制系统方向发展。从而产生了新一代的智能压力变送器。它们的主要特点如下。</br>1、自补偿功能如非线性、温度误差、响应时间、噪声和交叉感应等。</br>2、自诊断功能如在接通电源时进行自检,在工作中实现运行检查。</br>3、微处理器和基本传感器之间具有双向通信的功能构成闭环工作系统。</br>4、信息存储和记忆功能。</br>5、数字量输出。</br>基于上述功能,智能压力变送器的精度、稳定性、重复性和可靠性都得到提高和改善。其双向通信能力实现了计算机软件控制及远程设定量程等状态。</br>智能型压力变送器主要分为带协HART协议的和带482或RS232接口的两种类型。带HART协议的智能压力变送器是在模拟信号上迭加一个专用频率信号,实现模拟和数字同时进行通信。带RS232或485口的智能压力变送器内部将模拟信号A/D转换通过微处理器计算由D/A输出。RS232接口是异步通信协议接口,可与许多通信协议兼容。因此,后者应用非常广泛。</br>'
        },
        {
          title: '选型规则',
          time: '2013-08-19',
          key: 3,
          content: '1、变送器要测量什么样的压力：先确定系统中要确认测量</br>压力变送器</br>压力的最大值，一般而言，需要选择一个具有比最大值还要大1.5倍左右的压力量程的变送器。这主要是在很多系统，特别是水压测量和加工处理中，有峰值和持续不规则的上下波动，这种瞬间的峰值能破坏压力传感器，然而，由于这样做会精度下降。于是，可以用一个缓冲器来降低压力毛刺，但这样会降低传感器的响应速度。所以在选择变送器时，要充分考虑压力范围，精度与其稳定性。</br>2、什么样的压力介质：要考虑的是压力变送器所测量的介质，黏性液体、泥浆会堵上压力接口，溶剂或有腐蚀性的物质会不会破坏变送器中与这些介质直接接触的材料。一般的压力变送器的接触介质部分的材质采用的是316不锈钢，如果介质对316不锈钢没有腐蚀性，那么基本上所有的压力变送器都适合对介质压力的测量；如果介质对316不锈钢有腐蚀性，那么就要采用化学密封，这样不但起到可以测量介质的压力，也可以有效的阻止介质与压力变送器的接液部分的接触，从而起到保护压力变送器，延长了压力变送器的寿命.</br>3、变送器需要多大的精度：决定精度的有：非线性、迟滞性、非重复性、温度、零点偏置刻度、温度的影响，精度越高，价格也就越高。每一种电子式的测量计都会有精度误差，但是由于各个国家所标的精度等级是不一样的。</br>4、变送器的温度范围：通常一个变送器会标定两个温度范围，即正常操作的温度范围和温度可补偿的范围。正常操作温度范围是指变送器在工作状态下不被破坏的时候的温度范围，在超出</br></br>压力变送器（图5）</br>温度补范围时，可能会达不到其应用的性能指标。温度补偿范围是一个比操作温度范围小的典型范围。在这个范围内工作，变送器肯定会达到其应有的性能指标。温度变从两方面影响着其输出，一是零点漂移；二是影响满量程输出。如：满量程的+/-X%/℃，读数的+/-X%/℃，在超出温度范围时满量程的+/-X%，在温度补偿范围内时读数的+/-X%，如果没有这些参数，会导至在使用中的不确定性。变送器输出的变化到度是由压力变化引起的，还是由温度变化引起的。温度影响是了解如何使用变送器时最复杂的一部分。</br>5、需要得到怎样的输出信号：mV、V、mA及频率输出数字输出，选择怎样的输出取决于多种因素，包括变送器与系统控制器或显示器间的距离，是否存在“噪声”或其他电子干扰信号。是否需要放大器，放大器的位置等。对于许多变送器和控制器间距离较短的OEM设备，采用mA输出的变送器最为经济而有效的解决方法，如果需要将输出信号放大，最好采用具有内置放大的变送器。对于远距离传输出或存在较强的电子干扰信号，最好采用mA级输出或频率输出。如果在RFI或EMI指标很高的环境中，除了要注意到要选择mA或频率输出外，还要考虑到特殊的保护或过滤器。6、选择怎样的励磁电压：输出信号的类型决定选择怎么样的励磁电压。</br>压力变送器（图6）</br>多放大变送器有内置的电压调节装置，能够得到的一个工作电压决定是否采用带有调节器的传感器，选择传送器时要综合考虑工作电压与系统造价。</br>7、是否需要具备互换性的变送器：确定所需的变送器是否能够适应多个使用系统。一般来讲，这一点很重要。尤其是对于OEM产品，一旦将产品送到客户手中，那么客户用来校准的花销是相当大的。如果产品具有良好的互换性，那么即使是改变所用的变送器，也不会影响整个系统的效果。</br>8、变送器超时工作后需要保持稳定度：大部分变送器在经过超时工作后会产生“漂移”，因此很有必要在购买前了解变送器的稳定度，这种预先的工作能减少将来使用中会出现的种种麻烦。</br>9、变送器的封装：变送器的封装，尤其往往容易忽略是它的机架，然而这一点在以后使用中会逐渐暴露出其缺点。在选购传送器传一定要考虑到将来变送器的工作环境，湿度如何，怎样安装变送器，会不会有强烈的撞击或振动等。</br>10、在变送器与其它电子设备间采用怎样的连接：是否需要采用短距离连接，若是采用长距离连接，是否需要采用一个连接器。'
        },
        {
          title: '日常维护',
          time: '2013-08-19',
          key: 4,
          content: '1、检查安装孔的尺寸：如果安装孔的尺寸不合适，传感器在安装过程中，其螺纹部分就很容易受到磨损。这不仅会影响设备的密封性能，而且使压力传感器不能充分发挥作用，甚至还可能产生安全隐患。只有合适的安装孔才能够避免螺纹的磨损（螺纹工业标准1/2-20 UNF 2B），通常可以采用安装孔测量仪对安装孔进行检测，以做出适当的调整。</br>2、保持安装孔的清洁：保持安装孔的清洁并防止熔料堵塞对保证设备的正常运行来说十分重要。在挤出机被清洁之前，所有的压力传感器都应该从机筒上拆除以避免损坏。在拆除传感器时，熔料有可能流入到安装孔中并硬化，如果这些残余的熔料没有被去除，当再次安装传感器时就可能造成其顶部受损。清洁工具包能够将这些熔料残余物去除。然而，重复的清洁过程有可能加深安装孔对传感器造成的损坏。如果这种情况发生，就应当采取措施来升高传感器在安装孔中的位置。</br>3、选择恰当的位置：当压力传感器的安装位置太靠近生产线的上游时，未熔融的物料可能会磨损传感器的顶部；如果传感器被安装在太靠后的位置，在传感器和螺杆行程之间可能会产生熔融物料的停滞区，熔料在那里有可能产生降解，压力信号也可能传递失真；如果传感器过于深入机筒，螺杆有可能在旋转过程中触碰到传感器的顶部而造成其损坏。一般来说，传感器可以位于滤网前面的机筒上、熔体泵的前后或者模具中。</br>4、仔细清洁；在使用钢丝刷或者特殊化合物对挤出机机筒进行清洁前，应该将所有的传感器都拆卸下来。因为这两种清洁方式都可能会造成传感器的震动膜受损。当机筒被加热时，也应该将传感器拆卸下来并使用不会产生磨损的软布来擦拭其顶部，同时传感器的孔洞也需要用清洁的钻孔机和导套清理干净。</br>5、保持干燥：尽管传感器的电路设计能够经受苛刻的挤出加工环境，但是多数传感器也不能绝对防水，在潮湿的环境下也不利于正常运行。因此，需要保证挤出机机筒的水冷装置中的水不会渗漏，否则会对传感器造成不利影响。如果传感器不得不暴露在水中或潮湿的环境下，就要选择具有极强防水性的特殊传感器。</br>6、避免低温干扰：在挤出生产过程中，对于塑料原料而言，从固体到熔融状态应当具有充足的“浸透时间”。如果挤出机在开始进行生产前还没有达到操作温度，那么传感器和挤出机都会受到一定程度的损坏。另外，如果传感器从冷的挤出机上被拆除，材料就可能粘附在传感器顶部引起震动膜的损坏。因此，在拆除传感器之前，应确认机筒的温度足够高，机筒内部的物料处于软化状态下。</br>7、防止压力过载：即使压力传感器测压范围的过载设计最高能够达到50%(超出最大量程的比率)，从设备运行的安全角度考虑也应该尽量避免冒险，最好选择被测压力处于量程范围之内的传感器。在通常情况下，所选传感器的最佳量程应该是被测压力的2倍，这样即使挤出机在极高的压力下运行，也能避免压力传感器受到损坏。 压力变送器要求每周检查一次，每个月检验一次，主要是清除仪器内的灰尘，对电器元件认真检查，对输出的电流值要经常校对，压力变送器内部是弱电，一定要同外界强电隔开。</br>'
        },
        {
          title: '规程——检验变送器',
          time: '2013-08-19',
          key: 5,
          content: '检定规程是一个国家对所使用的要计量的装置等来进行校准的一个规定！它是一个标准！是制造装备和检定装置的一个衡量标准！</br>一 概述</br>压力变送器是一种将压力变量转换为可传送的统一输出信号的仪表，而且其输出信号与压力变量之间有一给定的连续函数关系，通常为线性函数。</br>       压力变量包括正、负压力，差压和绝对压力。</br>       压力变送器有电动和气动两大类，电动的统一输出信号为0-10mA, 4-20mA(或1-5V)的直流电信号，气动的统一输出信号为20-100kPa的气体压力。</br>       压力变送器按不同的转换原理可分为力（力矩）平衡式、电容式、电感式、奕变式和频率式，等等。</br>检定工作：</br>    １、进行外观检查，应符合规程要求。</br>变送器的铭牌应完整、清晰、应注明产品名称、型号、规格、测量范围等主要技术指标，高、低压容室应有明显标记，还应标明制造厂的名称或商标、出厂编号、制造年月。变送器零部件应完整无损，紧固件不得有松动和损伤现象，可动部分应灵活可靠。新制造的变送器的外壳、零件表面涂覆层应无锈蚀、完好、光洁，内部不得有杂物，使用中和修理后的变送器不允许有影响使用和计量性能的缺陷。</br>    ２、密封性检查：所用传压介质为空气或无毒的化学性能稳定的气体，大于0.25MPa的变送器一般用液体。 当测量室压力达到测量上限值时，切断压力源，密封一段时间在最后几分钟内通过压力表观察压力值的变化情况。</br>    ３、基本误差的检定：将变送器与压力标准器输出负载及检测装置连接起来。电动变送器除制造厂另有规定外，一般需通电预热十五分钟，</br>检定点应不少于4个，并应均匀地分布在整个测量范围上。</br>４、检定时从下限值开始，平稳地改变压力信号到各检定点，读取并记录输出值直至上限；然后反方向平稳地改变压力信号到各检定点，读取并记录输出值直至下限。'
        },
        {
          title: '四川思贝肯2012年公司活动',
          time: '2012-01-17',
          key: 6,
          content: '   2012年1月7日上午9点，全体同事集合向有“川南胜境”之称的泸山进军。泸山东临碧波如镜的邛海，西濒蜿蜒秀丽的安宁河，北有历史古城西昌，南依巍巍耸立的螺髻山。山上古树参天，松树尤其茂盛，古人曾用“松风水月”来描绘泸山邛海的风光。林中小道逶迤蜿蜒，排立路旁的苍松翠柏把我们引向山中，一路上不时有调皮可爱的小猴在林中嬉戏，大家一路上笑笑闹闹，爬山的劳累顿时烟消云散。登上高处，凉爽的清风拂面，精神也为之一振。雄关漫道真如铁，而今迈步从头越，我们相信，我们一起用信心和勇气，昂首阔步，一定能书写一个更加灿烂的2012！'
        },
        {
          title: '四川思贝肯2011年会',
          time: '2012-01-17',
          key: 7,
          content: '时光飞逝，岁月如梭，转眼间忙碌的2011年已过去，充满期待的2012年向我们走来。新的一年，孕育新的目标和希望。  2012年1月6日，阳光明媚，风和日丽，在风景优美的邛海海畔，思贝肯全体员工齐聚一堂，共同召开四川思贝肯自控工程有限公司2011年年会。会上，总经理陈庆乐做了2011年工作总结报告，并对公司未来发展方向做了全面规划，公司销售部、技术部、行政部以及总经办分别对本部门的工作进行了总结，提出了存在的问题以及解决措施，大家期待在新的一年里，取得更好的成绩。'
        },
        {
          title: '中标中石油彭州石化项目',
          time: '2011-11-18',
          key: 8,
          content: '2011年11月15日我公司正式接获中国石油四川石化有限责任公司发布的中标通知书。中得中石油四川项目“渣油加氢装置“以及“柴油加氢精制装置”变送器框架外采购招标项目。</br>   此次中标，充分说明了四川思贝肯自控工程有限公司作为霍尼韦尔仪表西南总经销以及技术服务中心得到行业认同，对所售产品完全有能力提供成套的技术方案以及售后服务支持。</br>   此次中标，是我公司发展由量变到质变的一次飞跃，为我司正式进入石油行业垫定了坚实的基础，从而使公司发展迈上一个新的台阶，</br>简介：</br>中国石油四川石化有限责任公司隶属于中石油，由中国石油天然气股份有限公司和成都石油化工有限责任公司共同投资，项目选址在四川省成都彭州市工业园区，规划设计生产能力为1000万吨/年炼油和80万吨/年乙烯。'
        },
        {
          title: '差压 绝压 微差压 区别',
          time: '2010-11-01',
          key: 9,
          content: '压力变送器是一个统称。</br>压力表，肯定很好理解了，就是测量压力参数的。有普通压力表，不锈钢压力表，隔膜压力表等等。</br>基本上测的是表压。表压是相对绝压来说的，一般表压是在太气压下的指示的压力值。表压=绝对压力-大气压力。</br>绝压呢就是相对于真空状态的0压力来说。多用于带有负压值的测量，负压值就是指低于大气压多少嘛。</br>差压就是有两个测量点的压力值之差嘛。大多用于液位的测量。</br>微差压嘛，顾名思议就是微小的压力差值的测量。要求精度高就用微差压。'
        },
      ]
    };
  },
  mounted() {
    //new WOW().init();  直接引用，默认配置，如果需要修改配置用下面的一段代码
    let wow = new WOW({
      boxClass: "wow",
      animateClass: "animated",
      offset: 0,
      mobile: true,
      live: true,
    });
    wow.init();
  },
  methods: {
    goDetail(data) {
      this.$router.push({name: 'detail', params: {title: data.title, content: data.content, time: data.time}})
    }
  }
};
</script>

<style lang="scss" scoped>
* {
  margin: 0;
  padding: 0;
}
.banner {
  width: 100%;
  position: absolute;
  left: 0;
  top: 0;
  z-index: -1;
  img {
    width: 100%;
  }
}
.title {
  margin-top: 0;
  text-align: center;
  overflow: hidden;
  display: flex;
  justify-content: center;
  align-items: center;
  color: #fff;
  .titleText {
    text-align: left;
    > div > div {
      margin-top: 10px;
      font-size: 24px;
      font-family: Microsoft YaHei;
      font-weight: 400;
      line-height: 32px;
    }
    > div > div:first-child {
      margin-top: 500px;
      margin-bottom: 30px;
      font-size: 48px;
      font-family: Microsoft YaHei;
      font-weight: bold;
      line-height: 32px;
    }
  }
}
.computer {
  width: 750px;
}
.downLoad {
  margin-top: 200px;
}
.downLeft {
  text-align: right;
  > div > div {
    margin-right: 100px;
    font-size: 20px;
    font-family: Microsoft YaHei;
    font-weight: 400;
    color: rgba(116, 119, 140, 1);
    line-height: 32px;
  }
}
.downLoadBtn {
  width: 400px;
  height: 100px;
  background-color: #ffea5b;
  display: flex;
  justify-content: center;
  align-items: center;
  font-size: 28px;
  font-family: Microsoft YaHei;
  font-weight: 400;
  color: rgba(114, 147, 255, 1);
  line-height: 32px;
  > div {
    width: 60%;
    height: 100%;
    display: flex;
    justify-content: space-around;
    align-items: center;
  }
  img {
    width: 48px;
    height: 54px;
  }
}
.allthree{
  margin-top: 100px;
}
.threeBox {
  width: 500px;
  height: 200px;
  margin: 50px auto;
  position: relative;
  cursor: pointer;
  .threeBtm {
    position: absolute;
    left: 0;
    top: 0;
    width: 500px;
    height: 200px;
    background-color: #7293ff;
  }
  .threeTop {
    position: absolute;
    left: 10px;
    top: 10px;
    width: 500px;
    height: 200px;
    overflow: hidden;
    img {
      width: 100%;
      position: absolute;
    }
    > div {
      position: absolute;
      width: 100%;
      height: 100%;
      background-color: rgba(0, 0, 0, 0.5);
      font-size: 26px;
      font-family: Microsoft YaHei;
      font-weight: 400;
      text-align: center;
      color: rgba(255, 255, 255, 1);
      text-align: center;
      line-height: 100px;
      .time{
        font-size: 16px;
        color: rgb(194, 194, 194);
      }
    }
  }
}
@media screen and (max-width: 1366px) {
  .title {
    margin-top: 100px;
    text-align: center;
    .titleText {
      text-align: center;
      > div > div {
        margin-top: 10px;
      }
      > div > div:first-child {
        margin-top: 100px;
        margin-bottom: 30px;
      }
    }
  }
  .computer {
    width: 400px;
  }
  .downLeft {
    text-align: center;
    > div > div {
      margin-right: 0;
    }
  }
  .downLoadBtn {
    margin: auto;
    margin-top: 40px;
  }
  .allthree {
    margin-top: 100px;
  }
  .threeBox {
    margin: 50px auto;
  }
}
</style>
